EvanClements/esp32_ipod_classic/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB flash (N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table: dual OTA slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# 8MB octal PSRAM (N16R8) — large allocations (decoder/audio buffers) land here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# OTA rollback (app must mark itself valid after boot)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Allow plain-HTTP OTA for LAN update servers
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# FATFS long filenames on heap
CONFIG_FATFS_LFN_HEAP=y

# TinyUSB mass storage (raw SD card exposed over native USB)
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192

# ESP-ADF still uses legacy FreeRTOS typedefs (xQueueHandle etc.)
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
